In [2]:
import pandas as pd
import sqlite3
import seaborn as sns
import matplotlib.pyplot as plt

In [6]:
def main():
    conn = sqlite3.connect("C:/Users/megan.lieu/Downloads/SQLCaseStudy/SQLCaseStudy/CaseStudy.db")
   
    #tables for Marvel questions
    
    
#     WORK FOR #1 - MARVEL
    sql1 = "select name, CAST(Num_Appear AS INT) AS Num_Appearances from (\
    select name, APPEARANCES, ROW_NUMBER() OVER (ORDER BY CAST(APPEARANCES AS INT)) AS Top10Appearances\
    , ROW_NUMBER() OVER (ORDER BY CAST(APPEARANCES AS INT) desc) AS Bottom10Appearances\
    , CASE WHEN APPEARANCES = '' THEN 0 ELSE APPEARANCES END AS 'Num_Appear'\
    from Marvel_Character\
    WHERE APPEARANCES != '') \
    WHERE Top10Appearances <= 10 or Bottom10Appearances <= 10;"

    df_MC = pd.read_sql_query(sql1, conn)
    print(df_MC)
    
    
#     sql = """select name, CAST(APPEARANCES AS INT) AS Bottom_Num_Appearances from Marvel_Character
#     union
#     select name, CAST(APPEARANCES AS INT) AS Top_Num_Appearances from Marvel_Character
#     order by Bottom_Num_Appearances, Top_Num_Appearances desc limit 10"""


#     WORK FOR #2 - MARVEL
    sql2 = "SELECT name, FIRST_APPEARANCE, year_first_appear, Num_Years_Appeared FROM (\
    SELECT name, FIRST_APPEARANCE, year_first_appear, ROW_NUMBER() OVER (ORDER BY 2022 - CAST(year_first_appear AS INT) DESC) AS Top10TimeAppear\
    , ROW_NUMBER() OVER (ORDER BY 2022 - CAST(year_first_appear AS INT)) AS Bottom10TimeAppear\
    , CASE WHEN year_first_appear = '' THEN 0 ELSE 2022 - CAST(year_first_appear AS INT) END AS 'Num_Years_Appeared'\
    FROM Marvel_Character \
    WHERE FIRST_APPEARANCE != '')\
    WHERE Top10TimeAppear <= 10 or Bottom10TimeAppear <= 10;"

#     sql = "select substr('JanFebMarAprMayJunJulAugSepOctNovDec', strftime('%m', FIRST_APPEARANCE) * 3, 3) from Marvel_Character"
    df_MC = pd.read_sql_query(sql2, conn)
    print(df_MC)
    
#     WORK FOR #3 - MARVEL    
    sql3 = "WITH GenderCount AS (\
    SELECT a.name, a.year_first_appear, b.SEX\
    FROM Marvel_Character a INNER JOIN Marvel_Description b\
    ON a.page_id = b.page_id)\
    , DecadeCount AS (\
    SELECT name, SEX, CASE \
        WHEN year_first_appear LIKE '193%' THEN '1930s'\
        WHEN year_first_appear LIKE '194%' THEN '1940s'\
        WHEN year_first_appear LIKE '195%' THEN '1950s'\
        WHEN year_first_appear LIKE '196%' THEN '1960s'\
        WHEN year_first_appear LIKE '197%' THEN '1970s'\
        WHEN year_first_appear LIKE '198%' THEN '1980s'\
        WHEN year_first_appear LIKE '199%' THEN '1990s'\
        WHEN year_first_appear LIKE '200%' THEN '2000s'\
        WHEN year_first_appear LIKE '201%' THEN '2010s'\
        ELSE '2020s' END AS decade_first_appear\
    from GenderCount)\
    \
    SELECT decade_first_appear AS Decade, \
    CASE WHEN SEX = '' THEN 'Unspecified' ELSE SEX END AS Gender, \
    COUNT(*) AS Count, \
    (COUNT(*) * 100.0 / SUM(COUNT(*)) OVER (PARTITION BY decade_first_appear)) AS 'GenderRatio (%)'\
    FROM DecadeCount\
    GROUP BY decade_first_appear, SEX"

    df_MD = pd.read_sql_query(sql3, conn)
    print(df_MD)


#   WORK FOR #4

    sql4 = "SELECT distinct b.SEX, a.APPEARANCES, COUNT(*) AS Frequency\
    FROM Marvel_Character a\
    left join Marvel_Description b\
    ON a.page_id = b.page_id\
    WHERE b.SEX != ''\
    AND a.APPEARANCES != ''\
    GROUP BY b.SEX, a.APPEARANCES\
    ORDER BY COUNT(*) DESC"
    
#     sql4 = "WITH \
#         Appearances_by_Eyes AS (\
#         SELECT a.name, a.year_first_appear, a.APPEARANCES, b.EYE, b.SEX\
#         FROM Marvel_Character a INNER JOIN Marvel_Description b\
#         on a.page_id = b.page_id),\
#         \
#         Appearances_Counts AS (\
#         SELECT CASE WHEN SEX = '' THEN 'Unspecified Gender' ELSE SEX END AS Gender\
#         , CASE WHEN EYE = '' THEN 'Unspecified Eyes' ELSE EYE END AS Eye_Color\
#         , SEX || ' + ' || EYE AS Category\
#         , SUM(APPEARANCES) AS Num_Appearances\
#         FROM Appearances_by_Eyes\
#         GROUP BY SEX, EYE\
#         ORDER BY SUM(APPEARANCES) DESC)\
#         \
#         SELECT * FROM Appearances_by_Eyes WHERE EYE LIKE '%brown%' AND SEX LIKE '%male%'"

#     [FOR SUMMARY STATISTICS FOR BROWN-EYED CHARACTERS]:      
#         SELECT SEX, EYE, COUNT(*) AS 'Count', SUM(CAST(APPEARANCES AS INT)) AS Total_Appearances, AVG(CAST(APPEARANCES AS INT)) AS Average_Appearances, MAX(CAST(APPEARANCES AS INT)) AS Max_Appearances, MIN(CAST(APPEARANCES AS INT)) AS Min_Appearances\
#         FROM Appearances_by_Eyes\
#         WHERE EYE LIKE '%brown%'\
#         AND SEX LIKE '%male%'\
#         AND SEX NOT LIKE '%female%'\
#         AND APPEARANCES != ''\
#         GROUP BY SEX, EYE\
#         UNION\
#         SELECT SEX, EYE, COUNT(*) AS 'Count', SUM(CAST(APPEARANCES AS INT)) AS Total_Appearances, AVG(CAST(APPEARANCES AS INT)) AS Average_Appearances, MAX(CAST(APPEARANCES AS INT)) AS Max_Appearances, MIN(CAST(APPEARANCES AS INT)) AS Min_Appearances\
#         FROM Appearances_by_Eyes\
#         WHERE EYE LIKE '%brown%'\
#         AND SEX LIKE '%female%'\
#         AND APPEARANCES != ''\
#         GROUP BY SEX, EYE"
    
#     [FOR FULL DISTRIBUTION OF ALL EYE COLORS AND GENDERS]:    
#     SELECT Gender, Eye_Color, Gender || ' + ' || Eye_Color AS Description, Num_Appearances FROM Appearances_Counts\
#     WHERE Eye_Color LIKE '%brown%'\
#     AND (Gender LIKE '%male%' OR Gender LIKE '%female%')"

#     [FOR STATS ON ENTIRE POPULATION BY GENDER AND EYE COLOR]:
#     SELECT a.Category, a.Num_Appearances\
#     FROM Appearances_Counts a\
#     INNER JOIN (\
#         SELECT Category\
#         , MAX(Num_Appearances) Num_Appearances\
#         FROM Appearances_Counts\
#     ) b ON a.Category = b.Category AND a.Num_Appearances = b.Num_Appearances\
#     UNION\
#     SELECT a.Category, a.Num_Appearances\
#     FROM Appearances_Counts a\
#     INNER JOIN (\
#         SELECT Category\
#         , MIN(Num_Appearances) Num_Appearances\
#         FROM Appearances_Counts\
#     ) b ON a.Category = b.Category AND a.Num_Appearances = b.Num_Appearances"

    
    df_MD = pd.read_sql_query(sql4, conn)
    print(df_MD.to_clipboard())

#   MORE DISTRIBUTION STATS    
    print(df_MD['APPEARANCES'].describe())
    
#     fig, ax = plt.subplots(figsize = ( 20 , 15 ))
#     sns.histplot(df_MD['APPEARANCES'])
#     ax.set_xlabel('Appearances')
#     plt.ylabel("Count")
#     plt.xticks(rotation=60, fontsize=7.5)
#     plt.grid()
#     plt.show()
        
if __name__=="__main__":
    main()

                                     name  Num_Appearances
0                      Bardak (Earth-616)                1
1       Bends (Masked Raider) (Earth-616)                1
2                Blackie Ross (Earth-616)                1
3                       Bleck (Earth-616)                1
4                 Cal Brunder (Earth-616)                1
5              Constance Rand (Earth-616)                1
6   Dead Shot (Masked Raider) (Earth-616)                1
7     Dr. Lang (The Big Boss) (Earth-616)                1
8                Dutch Hansen (Earth-616)                1
9                       Ganya (Earth-616)                1
10             Jonathan Storm (Earth-616)             1934
11              Scott Summers (Earth-616)             1955
12             Hulk (Robert Bruce Banner)             2017
13              Reed Richards (Earth-616)             2072
14             Benjamin Grimm (Earth-616)             2255
15                    Thor (Thor Odinson)             2258
16      Iron Man (Anthony \"Tony\" Stark)             2961
17    Wolverine (James \"Logan\" Howlett)             3061
18        Captain America (Steven Rogers)             3360
19              Spider-Man (Peter Parker)             4043
                                     name FIRST_APPEARANCE year_first_appear  \
0       Human Torch (Android) (Earth-616)           Oct-39              1939
1             Thomas Halloway (Earth-616)           Oct-39              1939
2                       Dorma (Earth-616)           Oct-39              1939
3              Phineas Horton (Earth-616)           Oct-39              1939
4                  David Rand (Earth-616)           Oct-39              1939
5                         Zar (Earth-616)           Oct-39              1939
6                 Jim Gardley (Earth-616)           Oct-39              1939
7                      Trajah (Earth-616)           Oct-39              1939
8   Lightning (Masked Raider) (Earth-616)           Oct-39              1939
9                       Chaka (Earth-616)           Oct-39              1939
10                   Eva Bell (Earth-616)           Jan-13              2013
11           Christopher Muse (Earth-616)           Jan-13              2013
12             Benjamin Deeds (Earth-616)           Feb-13              2013
13               Fabio Medina (Earth-616)           Apr-13              2013
14                Isabel Kane (Earth-616)           Feb-13              2013
15              Emily Preston (Earth-616)           Jan-13              2013
16            Iara Dos Santos (Earth-616)           Jan-13              2013
17               Kevin Connor (Earth-616)           May-13              2013
18         Anna Maria Marconi (Earth-616)           May-13              2013
19                 H.E.L.E.N. (Earth-616)           Jan-13              2013

    Num_Years_Appeared
0                   83
1                   83
2                   83
3                   83
4                   83
5                   83
6                   83
7                   83
8                   83
9                   83
10                   9
11                   9
12                   9
13                   9
14                   9
15                   9
16                   9
17                   9
18                   9
19                   9
   Decade                  Gender  Count  GenderRatio (%)
0   1930s             Unspecified      3         4.347826
1   1930s       Female Characters     10        14.492754
2   1930s         Male Characters     56        81.159420
3   1940s             Unspecified     41         2.845246
4   1940s       Female Characters    144         9.993060
5   1940s  Genderfluid Characters      1         0.069396
6   1940s         Male Characters   1255        87.092297
7   1950s             Unspecified     15         4.966887
8   1950s       Female Characters     52        17.218543
9   1950s         Male Characters    235        77.814570
10  1960s             Unspecified    117         8.958652
11  1960s      Agender Characters      6         0.459418
12  1960s       Female Characters    153        11.715161
13  1960s         Male Characters   1030        78.866769
14  1970s             Unspecified    135         6.042972
15  1970s      Agender Characters      4         0.179051
16  1970s       Female Characters    437        19.561325
17  1970s         Male Characters   1658        74.216652
18  1980s             Unspecified    116         4.783505
19  1980s      Agender Characters      1         0.041237
20  1980s       Female Characters    628        25.896907
21  1980s         Male Characters   1680        69.278351
22  1990s             Unspecified    212         5.797101
23  1990s      Agender Characters     11         0.300793
24  1990s       Female Characters    963        26.333060
25  1990s         Male Characters   2471        67.569046
26  2000s             Unspecified    112         3.629294
27  2000s      Agender Characters      8         0.259235
28  2000s       Female Characters    922        29.876863
29  2000s  Genderfluid Characters      1         0.032404
30  2000s         Male Characters   2043        66.202203
31  2010s             Unspecified     44         4.226705
32  2010s      Agender Characters      6         0.576369
33  2010s       Female Characters    319        30.643612
34  2010s         Male Characters    672        64.553314
35  2020s             Unspecified     59         7.239264
36  2020s      Agender Characters      9         1.104294
37  2020s       Female Characters    209        25.644172
38  2020s         Male Characters    538        66.012270
None
count     514
unique    358
top         6
freq        3
Name: APPEARANCES, dtype: object

In [9]:
def main():
    conn = sqlite3.connect("C:/Users/megan.lieu/Downloads/SQLCaseStudy/SQLCaseStudy/CaseStudy.db")
   
    #tables for DC questions
    
    
#     WORK FOR #1 - DC    
    sql1 = "SELECT name, CAST(Num_Appear AS INT) AS Num_Appearances FROM (\
     SELECT name, APPEARANCES, ROW_NUMBER() OVER (ORDER BY CAST(APPEARANCES AS INT)) AS Top10Appearances\
     , ROW_NUMBER() OVER (ORDER BY CAST(APPEARANCES AS INT) desc) AS Bottom10Appearances\
     , CASE WHEN APPEARANCES = '' THEN 0 ELSE APPEARANCES END AS 'Num_Appear'\
     FROM DC_Character\
     WHERE APPEARANCES != '') \
     WHERE Top10Appearances <= 10 or Bottom10Appearances <= 10;"
    
    df_MC = pd.read_sql_query(sql1, conn)
    print(df_MC)    
    

#     WORK FOR #2 - DC
    sql2 = "select * from DC_Character"
    
#     "SELECT name, FIRST_APPEARANCE, year_first_appear, Num_Years_Appeared FROM (\
#     SELECT name, FIRST_APPEARANCE, year_first_appear, ROW_NUMBER() OVER (ORDER BY 2022 - CAST(year_first_appear AS INT) DESC) AS Top10TimeAppear\
#     , ROW_NUMBER() OVER (ORDER BY 2022 - CAST(year_first_appear AS INT)) AS Bottom10TimeAppear\
#     , CASE WHEN year_first_appear = '' THEN 0 ELSE 2022 - CAST(year_first_appear AS INT) END AS 'Num_Years_Appeared'\
#     FROM DC_Character \
#     WHERE FIRST_APPEARANCE != '')\
#     WHERE Top10TimeAppear <= 10 or Bottom10TimeAppear <= 10;"


    df_MC = pd.read_sql_query(sql2, conn)
    print(df_MC)
    
#     WORK FOR #3 - DC
    sql3 = "select a.*, b.ALIGN, b.EYE, b.HAIR, b.SEX, b.GSM, b.ALIVE\
    from DC_Character a\
    left join DC_Description b\
    ON a.page_id = b.page_id"
    
#     "WITH GenderCount AS (\
#     SELECT a.name, a.year_first_appear, b.SEX\
#     FROM DC_Character a INNER JOIN DC_Description b\
#     ON a.page_id = b.page_id)\
#     , DecadeCount AS (\
#     SELECT name, SEX, CASE \
#         WHEN year_first_appear LIKE '193%' THEN '1930s'\
#         WHEN year_first_appear LIKE '194%' THEN '1940s'\
#         WHEN year_first_appear LIKE '195%' THEN '1950s'\
#         WHEN year_first_appear LIKE '196%' THEN '1960s'\
#         WHEN year_first_appear LIKE '197%' THEN '1970s'\
#         WHEN year_first_appear LIKE '198%' THEN '1980s'\
#         WHEN year_first_appear LIKE '199%' THEN '1990s'\
#         WHEN year_first_appear LIKE '200%' THEN '2000s'\
#         WHEN year_first_appear LIKE '201%' THEN '2010s'\
#         ELSE '2020s' END AS decade_first_appear\
#     from GenderCount)\
#     \
#     SELECT decade_first_appear AS Decade, \
#     CASE WHEN SEX = '' THEN 'Unspecified' ELSE SEX END AS Gender, \
#     COUNT(*) AS Count, \
#     (COUNT(*) * 100.0 / SUM(COUNT(*)) OVER (PARTITION BY decade_first_appear)) AS 'GenderRatio (%)'\
#     FROM DecadeCount\
#     GROUP BY decade_first_appear, SEX"    
    
    
    df_MD = pd.read_sql_query(sql3, conn)
    print(df_MD.to_clipboard())
    
if __name__=="__main__":
    main()

                               name  Num_Appearances
0   Springheeled Jack (Prime Earth)                1
1              Napalm (Prime Earth)                1
2               Adellca (New Earth)                1
3                Armory (New Earth)                1
4                Artois (New Earth)                1
5                   Aya (New Earth)                1
6             Backslash (New Earth)                1
7            Bayfrentos (New Earth)                1
8             Big Mummy (New Earth)                1
9   Bizarro Blue Beetle (New Earth)                1
10              Flash (Barry Allen)             1028
11   Dinah Laurel Lance (New Earth)             1075
12        Timothy Drake (New Earth)             1095
13           Aquaman (Arthur Curry)             1121
14      Wonder Woman (Diana Prince)             1231
15      Richard Grayson (New Earth)             1237
16         James Gordon (New Earth)             1316
17       Green Lantern (Hal Jordan)             1565
18            Superman (Clark Kent)             2496
19             Batman (Bruce Wayne)             3093
     page_id                          name  \
0       1422          Batman (Bruce Wayne)
1      23387         Superman (Clark Kent)
2       1458    Green Lantern (Hal Jordan)
3       1659      James Gordon (New Earth)
4       1576   Richard Grayson (New Earth)
...      ...                           ...
6891   66302       Nadine West (New Earth)
6892  283475    Warren Harding (New Earth)
6893  283478  William Harrison (New Earth)
6894  283471  William McKinley (New Earth)
6895  150660            Mookie (New Earth)

                                   urlslug APPEARANCES FIRST_APPEARANCE  \
0             \/wiki\/Batman_(Bruce_Wayne)        3093        1939, May
1            \/wiki\/Superman_(Clark_Kent)        2496    1986, October
2       \/wiki\/Green_Lantern_(Hal_Jordan)        1565    1959, October
3         \/wiki\/James_Gordon_(New_Earth)        1316   1987, February
4      \/wiki\/Richard_Grayson_(New_Earth)        1237      1940, April
...                                    ...         ...              ...
6891       \/wiki\/Nadine_West_(New_Earth)
6892    \/wiki\/Warren_Harding_(New_Earth)
6893  \/wiki\/William_Harrison_(New_Earth)
6894  \/wiki\/William_McKinley_(New_Earth)
6895            \/wiki\/Mookie_(New_Earth)

     year_first_appear
0                 1939
1                 1986
2                 1959
3                 1987
4                 1940
...                ...
6891
6892
6893
6894
6895

[6896 rows x 6 columns]
None